MTOTurbulence/lsm/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 9.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 9.0;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 9.0;
        value           uniform 9.0;
    }

    Wall
    {
        type            epsilonWallFunction;
        value           uniform 1e-10;
    }

    right
    {
        type            symmetry;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
